{
  "riasec": [
    {
      "code": "R",
      "name": "Realistic",
      "summary": {
        "en": "You enjoy hands-on work, solving real-world problems, and using technical skills to build, fix, or create tangible things.",
        "mr": "तुम्हाला स्वतः हाताने काहीतरी करायला आवडतं. तुम्ही प्रत्यक्ष समस्या सोडवायला आणि काहीतरी तयार करायला आनंद मानता. तांत्रिक कौशल्य वापरून वस्तू बनवणं, दुरुस्त करणं किंवा सुधारणं तुम्हाला आवडतं."
      }
    },
    {
      "code": "I",
      "name": "Investigative",
      "summary": {
        "en": "You’re curious and analytical, enjoying exploration, research, and solving complex problems.",
        "mr": "तुम्ही जिज्ञासू आणि विचार करणारे आहात. तुम्हाला कठीण गोष्टी समजून घ्यायला आणि नवे शोध घ्यायला आवडतं. संशोधन, शोध आणि प्रश्न सोडवण्याच्या कामांमध्ये तुम्ही उत्तम काम करता."
      }
    },
    {
      "code": "A",
      "name": "Artistic",
      "summary": {
        "en": "You’re imaginative and expressive, thriving in creative fields like art, design, writing, or performance.",
        "mr": "तुमची कल्पनाशक्ती तेजस्वी आहे आणि तुम्ही तुमच्या भावना मोकळेपणाने व्यक्त करता. तुम्हाला काहीतरी वेगळं आणि सर्जनशील (क्रिएटिव) करायला आवडतं."
      }
    },
    {
      "code": "S",
      "name": "Social",
      "summary": {
        "en": "You enjoy helping and connecting with people, using empathy and teamwork to make a positive difference.",
        "mr": "तुम्हाला इतरांना मदत करायला आणि त्यांच्याशी जोडायला आवडतं. तुमच्यात सहानुभूती आणि टीममध्ये काम करण्याची कला आहे."
      }
    },
    {
      "code": "E",
      "name": "Enterprising",
      "summary": {
        "en": "You’re a confident and goal-driven leader who likes taking initiative, influencing others, and turning ideas into action.",
        "mr": "तुम्ही आत्मविश्वासू आणि उद्दिष्ट ठेवून काम करणारे आहात. तुम्हाला पुढे येऊन नेतृत्व करायला आणि इतरांवर चांगला प्रभाव टाकायला आवडतं."
      }
    },
    {
      "code": "C",
      "name": "Conventional",
      "summary": {
        "en": "You’re organized and detail-oriented, preferring structured environments with clear rules and systems.",
        "mr": "तुम्ही नीटनेटके आणि बारकाईने लक्ष देणारे आहात. तुम्हाला अशा ठिकाणी काम करायला आवडतं जिथे नियम आणि पद्धती ठरलेले असतात. यामुळे काम सुरळीत चालतं आणि तुम्ही सहज हाताळू शकता."
      }
    }
  ],
  "selectTop": {
    "method": "by_score_desc",
    "count": 3,
    "notes": "Sort the user's RIASEC scores descending and pick the top `count` codes. If ties occur, preserve original order or apply a tie-breaker."
  }
}
